ROLE_CHOICES: tuple[tuple[str, str], ...] = (
    ("운영진", "운영진"),
    ("부원", "부원"),
    ("관리자", "관리자"),
)

WORKOUT_LOCATION_CHOICES: tuple[tuple[str, str], ...] = (
    ("더클라임 일산", "더클라임 일산"),
    ("더클라임 연남", "더클라임 연남"),
    ("더클라임 양재", "더클라임 양재"),
    ("더클라임 신림", "더클라임 신림"),
    ("더클라임 마곡", "더클라임 마곡"),
    ("더클라임 홍대", "더클라임 홍대"),
    ("더클라임 서울대", "더클라임 서울대"),
    ("더클라임 강남", "더클라임 강남"),
    ("더클라임 사당", "더클라임 사당"),
    ("더클라임 신사", "더클라임 신사"),
    ("더클라임 논현", "더클라임 논현"),
    ("더클라임 문래", "더클라임 문래"),
)

WORKOUT_LEVELS: tuple[tuple[int, str], ...] = (
    (1, "하얀색"),
    (2, "노란색"),
    (3, "주황색"),
    (4, "초록색"),
    (5, "파란색"),
    (6, "빨간색"),
    (7, "보라색"),
    (8, "회색"),
    (9, "갈색"),
    (10, "검정색"),
)
